OpenEIT/EIT_Firmware/ADuCM350.svd
			</registers>
  </peripheral>
  <peripheral>
			<name>ADI_GPT1</name>
			<description>General purpose Timer 1</description>
			<groupName>GPT1</groupName>
			<baseAddress>0x40000400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GP-TIMER1</name>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>GPT1LD</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<!--<description>16-bit load value</description>-->
					<fields>
						<field>
							<name>VALUE</name>
							<description>Load value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT1VAL</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<!--<description>"16-bit timer value, read only."</description>-->
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT1CON</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<!--<description>Control Register</description>-->
					<fields>
						<field>
							<name>EVENTEN</name>
							<!--<description>Enable time capture of an event</description>-->
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVENT</name>
							<description>Event select range. Timer event select range (0 to 15).</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UART</name>
									<value>0</value>
								<!--	<description>UART source</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0</name>
									<value>1</value>
								<!--	<description>- SPI0</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI1</name>
									<value>2</value>
							<!--		<description>- SPI 1</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>SPIH</name>
									<value>3</value>
						<!--			<description>- SPIH</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C_master</name>
									<value>4</value>
								<!--	<description>- I2C_slave</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C_master</name>
									<value>5</value>
									<!--<description>- I2C master</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S</name>
									<value>6</value>
							<!--		<description>-I2S</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>USB</name>
									<value>7</value>
								<!--	<description>- USB</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_DMA</name>
									<value>8</value>
								<!--	<description>- USB DMA</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>AFE_capture</name>
									<value>9</value>
								<!--	<description>- AFE capture</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>Beeper</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA_Error</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA_done</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GP_Flash_controller</name>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_0</name>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_2</name>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLD</name>
							<description>Timer reload on write to clear register</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock Select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PCLK</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFOSC</name>
									<value>1</value>
									<!--<description>- 16 MHz internal oscillator</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<value>2</value>
								<!--	<description>- Internal 32 kHz Oscillator</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<value>3</value>
									<!--<description>- External 32 kHz crystal</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
									<value>0</value>
									<!--<description>- counter starts at 0x0000 or 0xFFFF</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
									<value>1</value>
								<!--	<description>- counter starts at LOAD value</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UP</name>
							<description>Count-up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								<!--	<description>- counter is set to count down</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								<!--	<description>- counter is set to count up</description>-->
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<value>0</value>
							<!--		<description>- If the selected clock source is 0 or 1 then this setting results in a prescaler of 4.</description>-->
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GT1CLRI</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<!--<description>Clear interrupt register</description> -->
					<fields>
						<field>
							<name>CAP</name>
							<!--<description>Clear captured event interrupt</description>-->
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
						<!--	<description>Clear timeout interrupt</description>-->
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT1CAP</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<!--<description>Capture Register</description>-->
					<fields>
						<field>
							<name>VALUE</name>
							<description>Capture value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT1ALD</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<!--<description>Load Value, Asynchronous Register</description>-->
					<fields>
						<field>
							<name>ALOAD</name>
							<description>Value updated in the timer clock domain</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT1AVAL</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<!--<description>Counter Value, Asynchronous Register</description>-->
					<fields>
						<field>
							<name>AVAL</name>
							<description>Counter Value (current)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT1STA</name>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
				<!--	<description>Status Register</description>-->
					<fields>
						<field>
							<name>PDOK</name>
							<description>GPTCLRI[0] is updated in the timer clock domain</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Timer busy. Check after writing GPTCON.</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>READY</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_READY</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP</name>
							<description>Capture event pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Time out event occurred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
        <register>
					<name>GPT1PCON</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<!--<description>PWM Control Register</description>-->
					<fields>
						<field>
							<name>IDLE_STATE</name>
							<description>PWM idle state</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
              <enumeratedValues>
								<enumeratedValue>
									<name>IDLE_LOW</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE_HIGH</name>
									<value>1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>MATCH_EN</name>
							<description>PWM match enabled</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
              <enumeratedValues>
								<enumeratedValue>
									<name>PWM_TOGGLE</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MATCH</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
					<register>
					<name>GPT1PMAT</name>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
				<!--	<description>PWM Match Value Register</description>-->
					<fields>
						<field>
							<name>MATCH_VAL</name>
							<description>PWM Match Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
