OpenEIT/EIT_Firmware/ADuCM350.svd
			</registers>
		</peripheral>

  <peripheral>
			<name>ADI_PMU</name>
			<description>Power Management Unit</description>
			<groupName>PMU</groupName>
			<baseAddress>0x40002400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x80</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PWRMOD</name>
					<description>Power modes register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
					<fields>
						<field>
							<name>RAM0_RET</name>
							<description>Retention for RAM0</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS_not_retained</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN_retained</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WICENACK</name>
							<description>WIC acknowledgement for SLEEPDEEP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Power Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>acitve_mode</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CORE_SLEEP_mode</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYS_SLEEP_mode</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hibernate_mode</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWRKEY</name>
					<description>Key protection for the PWRMOD register.</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Key value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>KEY1</name>
									<value>18521</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEY2</name>
									<value>62075</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		

  <peripheral>  
			<name>ADI_OSCCTRL</name>
			<description>Oscillator Control</description>
			<groupName>OSCCTRL</groupName>
			<baseAddress>0x4000240C</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x8</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OSCKEY</name>
					<description>Write 0xCB14 to unlock the OSCCTRL register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000002</size>
					<fields>
						<field>
							<name>OSCKEY</name>
							<description>unlocking key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCK</name>
									<value>0xCB14</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>LOCKED</name>
									<value>0x0</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
				</register>
        <register>
					<name>OSCCTRL</name>
					<description>Oscillator Control Register (key protected)</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000002</size>
					<fields>
						<field>
							<name>HFXTALOK</name>
							<description>Status of HFXTAL oscillator</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNSTABLE</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>STABLE</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
							<name>LFXTALOK</name>
							<description>Status of LFXTAL oscillator</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNSTABLE</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>STABLE</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
            <name>HFOSCOK</name>
							<description>Status of HFOSC oscillator</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNSTABLE</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>STABLE</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
							<name>LFOSCOK</name>
							<description>Status of LFOSC oscillator</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNSTABLE</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>STABLE</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field> 
            <field>
							<name>HFXTALEN</name>
							<description>HF crystal oscillator enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>            
            <field>
							<name>LFXTALEN</name>
							<description>LF crystal oscillator enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>                
            <field>
							<name>HFOSCEN</name>
							<description>HF internal oscillator enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>                        
            <field>
							<name>LFOSCEN</name>
							<description>LF internal oscillator enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
		            </enumeratedValue>
		            <enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
		            </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
				</register>
