OpenEIT/EIT_Firmware/ADuCM350.svd
								</registers>
          </peripheral> 
          
  <peripheral>
			<name>ADI_GPIO0</name>
			<description>General Purpose Input Output</description>
			<groupName>GPIO0</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>GP0CON</name>
					<description>GPIO Port 0 configuration</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<fields>
						<field>
							<name>PIN15_CFG</name>
							<description>Configuration bits for P0.15</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPIH_Chip_Select</name>
									<value>01</value>
               </enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN14_CFG</name>
							<description>Configuration bits for P0.14</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPIH_MOSI</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN13_CFG</name>
							<description>Configuration bits for  P0.13</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPIH_MISO</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN12_CFG</name>
							<description>Configuration bits for  P0.12</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPIH_SCLK</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P11_CFG</name>
							<description>Configuration bits for P0.11</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								</enumeratedValues>
						</field>
						<field>
							<name>P10_CFG</name>
							<description>Configuration bits for P0.10</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_C_PWM_output</name>
									<value>01</value>
               </enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P9_CFG</name>
							<description>Configuration bits for P0.9</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>JTAG_clock_serial_wire_clock</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P8_CFG</name>
							<description>Configuration bits for P0.8</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>JTAG_test_mode_select_SWD</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P7_CFG</name>
							<description>Configuration bits for P0.7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>JTAG_serial_data_input</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO</name>
									<value>01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART_RX</name>
                <value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
            <field>
							<name>P6_CFG</name>
							<description>Configuration bits for P0.6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>JTAG_serial_data_input</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPIO</name>
									<value>01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART_TX</name>
                <value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P5_CFG</name>
							<description>Configuration bits for P0.5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Captouch_F_down</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4_CFG</name>
							<description>Configuration bits for P0.4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Captouch_E_up</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
            <field>
							<name>P3_CFG</name>
							<description>Configuration bits for P0.3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Captouch_D_enter</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
            <field>
							<name>P2_CFG</name>
							<description>Configuration bits for P0.2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Captouch_C_right</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
            <field>
							<name>P1_CFG</name>
							<description>Configuration bits for P0.1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Captouch_B_left</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
            <field>
							<name>P0_CFG</name>
							<description>Configuration bits for P0.0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Captouch_A_on_off</name>
									<value>01</value>
								</enumeratedValue>
							</enumeratedValues>
            </field>
					</fields>
				</register>
				<register>
					<name>GP0OEN</name>
          <description>GPIO Port 0 output enable register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<fields>
						<field>
							<name>OEN15</name>
							<description>Pin 15 output drive enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN14</name>
							<description>Pin 14 output drive enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN13</name>
							<description>Pin 13 output drive enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN12</name>
							<description>Pin 12 output drive enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN11</name>
							<description>Pin 11 output drive enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN10</name>
							<description>Pin 10 output drive enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN9</name>
							<description>Pin 9 output drive enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN8</name>
							<description>Pin 8 output drive enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN7</name>
							<description>Pin 7 output drive enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN6</name>
							<description>Pin 6 output drive enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN5</name>
							<description>Pin 5 output drive enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN4</name>
							<description>Pin 4 output drive enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN3</name>
							<description>Pin 3 output drive enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN2</name>
							<description>Pin 2 output drive enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN1</name>
							<description>Pin 1 output drive enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN0</name>
							<description>Pin 0 output drive enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>diabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP0PE</name>
          <description>GPIO Port 0 pin pull enable. Enable the pull up / pull down for the corresponding pin.</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000008</size>
					<fields>
						<field>
							<name>PUL15</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL14</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL13</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL12</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL11</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL10</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL9</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL8</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL7</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL6</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL5</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL4</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL3</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL2</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL1</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL0</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP0IEN</name>
          <description>GPIO Port 0 input path enable</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000008</size>
				</register>
