OpenEIT/EIT_Firmware/ADuCM350.svd
				<register>
					<name>GP0IN</name>
					<description>GPIO Port 0 data input.</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000008</size>
				</register>
				<register>
					<name>GP0OUT</name>
					<description>GPIO Port 0 data out.</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000008</size>
				</register>
				<register>
					<name>GP0SET</name>
					<description>GPIO Port 0 data out set</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000008</size>
				</register>
				<register>
					<name>GP0CLR</name>
					<description>GPIO Port 0 data out clear.</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000008</size>
				</register>
				<register>
					<name>GP0TGL</name>
					<description>GPIO Port 0 pin toggle</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000008</size>
				</register>
				<register>
					<name>GP0POL</name>
					<description>GPIO Port 0 Interrupt polarity; clear: high-&gt;low; set: low-&gt;high</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000008</size>
				</register>
        <register>
					<name>GP0IENA</name>
					<description>GPIO Port 0 Interrupt A enable</description>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000008</size>
				</register>
        <register>
					<name>GP0IENB</name>
					<description>GPIO Port 0 Interrupt B enable</description>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000008</size>
				</register>
				<register>
					<name>GP0INT</name>
					<description>GPIO Port 0 Interrupt status.  Indicates if rising/falling edge has been detected. Write 1 to clear.</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000008</size>
				</register>
			</registers>
		</peripheral>  
		
  <peripheral>
			<name>ADI_CLKCON</name>
			<description>Clock Control</description>
			<groupName>CLKCON</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x24</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLKCON0</name>
						<description>configure clock sources for various systems</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000016</size>
					<fields>
						<field>
							<name>HFXTALIE</name>
							<description>High frequency crystal interrupt enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
                </enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
						  <name>LFXTALIE</name>
							<description>Low frequency crystal interrupt enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
								<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
                </enumeratedValue>
							</enumeratedValues>
            </field>
            <field>
							<name>PLLMUX</name>
							<description>SPLL source select mux</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INTERNAL_RC</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT_XTAL</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					<field>
							<name>FIXMASTERTYPE</name>
							<description>Force MasterType for debugger</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LFCLKMUX</name>
							<description>32kHz clock select mux</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INTERNAL_32kHz_RC</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT_32kHz_XTAL</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKCOUT</name>
							<description>32kHz clock select mux</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ROOT_CLK</name>
									<value>0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LF_CLK</name>
									<value>0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CT_CLK</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HCLK_BUS</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HCLK_CORE</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCLK</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USBCTRLCLK</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USBPHYCLK</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT0_CLK</name>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT1_CLK</name>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT2_CLK</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT2_CLK</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WUT_CLK</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTCCNT_CLK</name>
									<value>12</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
              <field>
							<name>CLKMUX</name>
							<description>Clock mux select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HF_INTERNAL</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HF_EXTERNAL</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT_GPIO</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
          </fields>
				</register>
				
				<register>
					<name>CLKCON1</name>
						<description>System Clocks Control Register 1 (divide rates)</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000016</size>
					<fields>
						<field>
							<name>PCLKDIVCNT</name>
							<description>PCLK divide count</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>USBCTLCLKDIVMUX</name>
							<description>USB control clock divider mux select</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLK_HCLK</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLK_2xHCLK</name>
									<value>1</value>
								</enumeratedValue>
								</enumeratedValues>
						</field>
						<field>
							<name>HCLKDIVCNT</name>
							<description>HCLK and CTCLK divide count</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
        </register>
				
				<register>
					<name>CLKCON3</name>
					<description>System Clocks Control Register 1 (divide rates)</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000016</size>
					<fields>
						<field>
							<name>PCLKDIVCNT</name>
							<description>PCLK divide count</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>USBCTLCLKDIVMUX</name>
							<description>USB control clock divider mux select</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLK_HCLK</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLK_2xHCLK</name>
									<value>1</value>
								</enumeratedValue>
								</enumeratedValues>
						</field>
						<field>
							<name>HCLKDIVCNT</name>
							<description>HCLK and CTCLK divide count</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
        </register>
        <register>
					<name>CLKCON4</name>
					<description>USB PLL Register</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000016</size>
					<fields>
						<field>
							<name>UPLLIE</name>
							<description>USB PLL interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPLLEN</name>
							<description>USB PLL enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPLLDIV2</name>
							<description>USB PLL division by 2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPLLMSEL</name>
							<description>USB PLL M divider</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<value>3</value>
								</enumeratedValue>
								</enumeratedValues>
						</field>
						<field>
							<name>UPLLNSEL</name>
							<description>USB PLL N multiplier</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
              </field>
					</fields>
        </register>
					
<register>
					<name>CLKCON5</name>
					<description>User Clock Gating Control Register</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000016</size>
					<fields>
						<field>
							<name>CTCLKOFF</name>
							<description>CTCLK user control. This bit disables the CTCLK.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
            <field>
							<name>ACLKOFF</name>
							<description>ACLK user control. This bit disables the ACLK and AFE_ADC_CLK.</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
            <field>
							<name>UCLKI2SOFF</name>
							<description>I2S clock user control. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UCLKUARTOFF</name>
							<description>UART clock user control. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
              <field>
							<name>UCLKI2COFF</name>
							<description>I2C clock user control. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UCLKSPIHOFF</name>
							<description>SPIH clock user control. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UCLKSPI1OFF</name>
							<description>SPI1 clock user control. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UCLKSPI0OFF</name>
							<description>SPI0 clock user control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						</fields>
						</register>
          <register>
					<name>CLKSTAT0</name>
					<description>Clocking Status Register</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000016</size>
					<fields>
						<field>
							<name>HFXTALNOK</name>
							<description>HF crystal not stable. Successfully disabled.</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HFXTALOK</name>
							<description>HF crystal stable. Sticky bit. Write 1 to clear; use for interrupt.</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HFXTALSTATUS</name>
							<description>HF crystal status.</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LFXTALNOK</name>
							<description>LF crystal not stable. Successfully disabled.</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LFXTALOK</name>
							<description>LF crystal stable. Sticky bit. Write 1 to clear; use for interrupt.</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LFXTALSTATUS</name>
							<description>LF crystal status.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPLLUNLOCK</name>
							<description>USB PLL unlock. Is set when PLL loses its lock (sticky), write 1 to clear</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPLLLOCK</name>
							<description>USB PLL lock. Is set when PLL locks (sticky), write 1 to clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPLLSTATUS</name>
							<description>USB PLL status. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPLLUNLOCK</name>
							<description>System PLL unlock. Is set when SPLL loses its lock (sticky), write 1 to clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPLLLOCK</name>
							<description>System PLL lock. Is set when SPLL locks (sticky), write 1 to clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPLLSTATUS</name>
							<description>System PLL status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
        </fields>
        </register>
