OpenEIT/EIT_Firmware/ADuCM350.svd
			</registers>
		</peripheral>
		
		
  <peripheral>
			<name>ADI_GPIO1</name>
			<description>General Purpose Input Output</description>
			<groupName>GPIO1</groupName>
			<baseAddress>0x40020040</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>GP1CON</name>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<description>GPIO Port 1 configuration</description>
					<fields>
            <field>
							<name>PIN_15_CFG</name>
							<description>Configuration bis 1.15</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 18</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 15</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_14_CFG</name>
							<description>Configuration bis 1.14</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 17</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 14</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_13_CFG</name>
							<description>Configuration bis 1.13</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 16</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 13</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_12_CFG</name>
							<description>Configuration bis 1.12</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 15</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 12</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_11_CFG</name>
							<description>Configuration bis 1.11</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 14</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 11</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_10_CFG</name>
							<description>Configuration bis 1.10</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 13</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 10</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_9_CFG</name>
							<description>Configuration bis 1.9</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 12</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 9</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
				   	<field>
							<name>PIN_8_CFG</name>
							<description>Configuration bis 1.8</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 11</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 8</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>	
						<field>
							<name>PIN_7_CFG</name>
							<description>Configuration bis 1.7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 10</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 7</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_6_CFG</name>
							<description>Configuration bis 1.6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 9</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 6</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_5_CFG</name>
							<description>Configuration bis 1.5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 8</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 5</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_4_CFG</name>
							<description>Configuration bis 1.4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 7</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 4</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_3_CFG</name>
							<description>Configuration bis 1.3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 6</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 3</name>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_2_CFG</name>
							<description>Configuration bis 1.2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 5</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 2</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI serial data in</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_1_CFG</name>
							<description>Configuration bis 1.1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 4</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 1</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI serial data out</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PIN_0_CFG</name>
							<description>Configuration b s 1.0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCD Driver Segment 3</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI Data 0</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PDI serial clock</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP1OEN</name>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Pin output drive enable</description>
				</register>
				<register>
					<name>GP1PE</name>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 output pull-up / pull-down enable.</description>
				</register>
				<register>
					<name>GP1IEN</name>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 input path enable. Each bit is set to enable and cleared to disable the input path for the GPIO pin</description>
				</register>
				<register>
					<name>GP1IN</name>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 registered data input.</description>
				</register>
				<register>
					<name>GP1OUT</name>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 data out.</description>
				</register>
				<register>
					<name>GP1SET</name>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 data out set</description>
				</register>
				<register>
					<name>GP1CLR</name>
					<addressOffset>0x0000001c</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 data out clear.</description>
				</register>
				<register>
					<name>GP1TGL</name>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 pin toggle.</description>
				</register>
			  <register>
					<name>GP1POL</name>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 interrupt polarity register.</description>
				 </register>
			  <register>
					<name>GP1IENA</name>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 Interrupt A enable register.</description>
				</register>
				<register>
					<name>GP1IENB</name>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 Interrupt B enable register.</description>
				</register>
				<register>
					<name>GP1INT</name>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 Interrupt status register.</description>
				</register>
				<register>
					<name>GP1DS</name>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000008</size>
					<description>GPIO Port 1 drive strength register.</description>
				</register>
